## 

DataFrame

In [1]:
import numpy as np
import pandas as pd

In [2]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])
df1 = pd.DataFrame([s1, s2]) # collection of seres
df1

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50

#### every row and column is a sereis

In [3]:
arr1 = np.arange(1,26).reshape(5,5)
df2 = pd.DataFrame(arr1)
df2

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

### giveng index after creating dataframe

In [4]:
df2.index = ['l1','l2','l3','l4','l5']
df2.columns = ['A','B','C','D','E']

df2

     A   B   C   D   E
l1   1   2   3   4   5
l2   6   7   8   9  10
l3  11  12  13  14  15
l4  16  17  18  19  20
l5  21  22  23  24  25

In [5]:
arr2 = np.arange(2, 41,2).reshape(4,5)
pd.DataFrame(arr2)

    0   1   2   3   4
0   2   4   6   8  10
1  12  14  16  18  20
2  22  24  26  28  30
3  32  34  36  38  40

### Differant ways of creating DataFrames

#### (SUBLIST WAY) ==== (One sublist means One row)

In [6]:
studants = pd.DataFrame([[1,"Aditya", 56, "M"],
                         [2, "Dipali", 70, 'F'],
                         [3,"soham",80, 'M'],
                         [4, 'sangita',99, 'F']],
                       columns =["Roll_no","Name","Marks","Gender"] )
studants

   Roll_no     Name  Marks Gender
0        1   Aditya     56      M
1        2   Dipali     70      F
2        3    soham     80      M
3        4  sangita     99      F

 ### (DICTIONARY FORMAT)

In [7]:
emp  = pd.DataFrame({"eid":[101,102,103,104,105],
                     "name":["dipaa","soham","pooja","sangita","doly"],
                     "salary":[30000,40000,50000,60000,70000]})
emp

   eid     name  salary
0  101    dipaa   30000
1  102    soham   40000
2  103    pooja   50000
3  104  sangita   60000
4  105     doly   70000

In [8]:
df1.iloc[0]

0    1
1    2
2    3
3    4
4    5
Name: 0, dtype: int64

In [9]:
details = pd.DataFrame({"intake":[120,60,120, 60],
                       "Admited": [118,50,100,55]},
                      index = ["civil","comp","it","tech"])
details

       intake  Admited
civil     120      118
comp       60       50
it        120      100
tech       60       55

### Adding column into the dataframe

In [10]:
details["vecant"]= [2,10,20,5]
details

       intake  Admited  vecant
civil     120      118       2
comp       60       50      10
it        120      100      20
tech       60       55       5

### Vectorization

#### substracting column to find vecant seats ===== (it will actually substract elements)

In [11]:
details['vecant']=details['intake']-details['Admited']
details

       intake  Admited  vecant
civil     120      118       2
comp       60       50      10
it        120      100      20
tech       60       55       5

In [12]:
emp

   eid     name  salary
0  101    dipaa   30000
1  102    soham   40000
2  103    pooja   50000
3  104  sangita   60000
4  105     doly   70000

In [13]:
## adding columns to the employee table 
emp["Address"]=["pune","pune","nanded","mumbai","nanded"]

In [14]:
## adding gender column to the employee table
emp["Gender"]=["F","M","F","F","F"]
emp

   eid     name  salary Address Gender
0  101    dipaa   30000    pune      F
1  102    soham   40000    pune      M
2  103    pooja   50000  nanded      F
3  104  sangita   60000  mumbai      F
4  105     doly   70000  nanded      F

## Adding new row into the existing dataframe

In [15]:
emp.loc[5] = [106, "aarti",66000,"nanded","f"]
emp

   eid     name  salary Address Gender
0  101    dipaa   30000    pune      F
1  102    soham   40000    pune      M
2  103    pooja   50000  nanded      F
3  104  sangita   60000  mumbai      F
4  105     doly   70000  nanded      F
5  106    aarti   66000  nanded      f

In [16]:
emp.size

30

In [17]:
emp.shape

(6, 5)

### Adding rows when we dont know how many rows are there ====(usefull when we are unpredictable)

In [18]:
emp.loc[emp.shape[0]] = [107, "Tanvi",230000,"Nashik","F"]

In [19]:
emp

   eid     name  salary Address Gender
0  101    dipaa   30000    pune      F
1  102    soham   40000    pune      M
2  103    pooja   50000  nanded      F
3  104  sangita   60000  mumbai      F
4  105     doly   70000  nanded      F
5  106    aarti   66000  nanded      f
6  107    Tanvi  230000  Nashik      F

## Deleting rows and  Columns

In [20]:

emp.drop("Gender", axis = 1,inplace= True)

In [21]:
emp

   eid     name  salary Address
0  101    dipaa   30000    pune
1  102    soham   40000    pune
2  103    pooja   50000  nanded
3  104  sangita   60000  mumbai
4  105     doly   70000  nanded
5  106    aarti   66000  nanded
6  107    Tanvi  230000  Nashik

In [22]:
# emp.drop(7,inplace=True)
# emp

In [23]:
details.drop(["comp","it"])

       intake  Admited  vecant
civil     120      118       2
tech       60       55       5

In [24]:
emp["dno"] = [1,2,3,4,5,6,7]

In [25]:
emp

   eid     name  salary Address  dno
0  101    dipaa   30000    pune    1
1  102    soham   40000    pune    2
2  103    pooja   50000  nanded    3
3  104  sangita   60000  mumbai    4
4  105     doly   70000  nanded    5
5  106    aarti   66000  nanded    6
6  107    Tanvi  230000  Nashik    7

In [26]:
dept = pd.DataFrame({"dno": [1,2,3,4],
                    "name": ["IT","Admin","HR","SCM"]})
dept

   dno   name
0    1     IT
1    2  Admin
2    3     HR
3    4    SCM

### Sclicing and Indexing

In [27]:
df2

     A   B   C   D   E
l1   1   2   3   4   5
l2   6   7   8   9  10
l3  11  12  13  14  15
l4  16  17  18  19  20
l5  21  22  23  24  25

In [28]:
# df2.loc["l1","A"]
# df2.loc["l2","B"]
# df2.loc["l3","C"]
# df2["E"]
# df2[["B","C"]]
df2.loc[["l1","l2"]]

    A  B  C  D   E
l1  1  2  3  4   5
l2  6  7  8  9  10

## Conditional selection

In [29]:
df2[df2%2 == 0]

       A     B     C     D     E
l1   NaN   2.0   NaN   4.0   NaN
l2   6.0   NaN   8.0   NaN  10.0
l3   NaN  12.0   NaN  14.0   NaN
l4  16.0   NaN  18.0   NaN  20.0
l5   NaN  22.0   NaN  24.0   NaN

In [30]:
df2[df2["B"]%2 == 0]

     A   B   C   D   E
l1   1   2   3   4   5
l3  11  12  13  14  15
l5  21  22  23  24  25

##### Details of employee who living in pune

In [31]:
emp[emp["Address"]== "pune"]

   eid   name  salary Address  dno
0  101  dipaa   30000    pune    1
1  102  soham   40000    pune    2

In [32]:
emp

   eid     name  salary Address  dno
0  101    dipaa   30000    pune    1
1  102    soham   40000    pune    2
2  103    pooja   50000  nanded    3
3  104  sangita   60000  mumbai    4
4  105     doly   70000  nanded    5
5  106    aarti   66000  nanded    6
6  107    Tanvi  230000  Nashik    7

In [33]:
emp["Gender"] = ["f","m","f","f","f","f","f"]
emp

   eid     name  salary Address  dno Gender
0  101    dipaa   30000    pune    1      f
1  102    soham   40000    pune    2      m
2  103    pooja   50000  nanded    3      f
3  104  sangita   60000  mumbai    4      f
4  105     doly   70000  nanded    5      f
5  106    aarti   66000  nanded    6      f
6  107    Tanvi  230000  Nashik    7      f

In [34]:
emp[emp["Gender"]=="m"]

   eid   name  salary Address  dno Gender
1  102  soham   40000    pune    2      m

In [35]:
emp[(emp["salary"]> 25000) & (emp["Address"]=="pune")]

   eid   name  salary Address  dno Gender
0  101  dipaa   30000    pune    1      f
1  102  soham   40000    pune    2      m

In [36]:
emp[emp["dno"]==2][["name","salary"]]

    name  salary
1  soham   40000

In [37]:
details

       intake  Admited  vecant
civil     120      118       2
comp       60       50      10
it        120      100      20
tech       60       55       5

In [38]:
details[(details["Admited"] / details["intake"])* 100 >95]

       intake  Admited  vecant
civil     120      118       2

### updating values

In [39]:
emp

   eid     name  salary Address  dno Gender
0  101    dipaa   30000    pune    1      f
1  102    soham   40000    pune    2      m
2  103    pooja   50000  nanded    3      f
3  104  sangita   60000  mumbai    4      f
4  105     doly   70000  nanded    5      f
5  106    aarti   66000  nanded    6      f
6  107    Tanvi  230000  Nashik    7      f

In [40]:
emp.loc[emp["name"]=="soham","salary"] = 310000

In [41]:
emp

   eid     name  salary Address  dno Gender
0  101    dipaa   30000    pune    1      f
1  102    soham  310000    pune    2      m
2  103    pooja   50000  nanded    3      f
3  104  sangita   60000  mumbai    4      f
4  105     doly   70000  nanded    5      f
5  106    aarti   66000  nanded    6      f
6  107    Tanvi  230000  Nashik    7      f

In [42]:
df1 = pd.DataFrame(np.arange(1,11).reshape(2,5))
df2 = pd.DataFrame(np.arange(21,31).reshape(2,5))

In [43]:
df1

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [44]:
df2

    0   1   2   3   4
0  21  22  23  24  25
1  26  27  28  29  30

In [45]:
df1+df2

    0   1   2   3   4
0  22  24  26  28  30
1  32  34  36  38  40

In [46]:
df1.columns=["A","B","C","D","E"]
df2.columns=["C","D","E","F","G"]

In [47]:
df1+df2

    A   B   C   D   E   F   G
0 NaN NaN  24  26  28 NaN NaN
1 NaN NaN  34  36  38 NaN NaN

### Concatination of two dataframes

In [48]:
pd.concat([df1,df2])

     A    B   C   D   E     F     G
0  1.0  2.0   3   4   5   NaN   NaN
1  6.0  7.0   8   9  10   NaN   NaN
0  NaN  NaN  21  22  23  24.0  25.0
1  NaN  NaN  26  27  28  29.0  30.0

#### Concatination ===(Column wise)

In [49]:
#### to avoiding null values we combine dataframes column wise 

pd.concat([df1,df2],axis= 1)

   A  B  C  D   E   C   D   E   F   G
0  1  2  3  4   5  21  22  23  24  25
1  6  7  8  9  10  26  27  28  29  30

In [50]:
emp

   eid     name  salary Address  dno Gender
0  101    dipaa   30000    pune    1      f
1  102    soham  310000    pune    2      m
2  103    pooja   50000  nanded    3      f
3  104  sangita   60000  mumbai    4      f
4  105     doly   70000  nanded    5      f
5  106    aarti   66000  nanded    6      f
6  107    Tanvi  230000  Nashik    7      f

In [51]:
dept

   dno   name
0    1     IT
1    2  Admin
2    3     HR
3    4    SCM

In [52]:
dept["lication"] = ["pune","mumbai","pune","mumbai"]

In [53]:
dept

   dno   name lication
0    1     IT     pune
1    2  Admin   mumbai
2    3     HR     pune
3    4    SCM   mumbai

In [54]:
pd.concat([emp,dept])

     eid     name    salary Address  dno Gender lication
0  101.0    dipaa   30000.0    pune    1      f      NaN
1  102.0    soham  310000.0    pune    2      m      NaN
2  103.0    pooja   50000.0  nanded    3      f      NaN
3  104.0  sangita   60000.0  mumbai    4      f      NaN
4  105.0     doly   70000.0  nanded    5      f      NaN
5  106.0    aarti   66000.0  nanded    6      f      NaN
6  107.0    Tanvi  230000.0  Nashik    7      f      NaN
0    NaN       IT       NaN     NaN    1    NaN     pune
1    NaN    Admin       NaN     NaN    2    NaN   mumbai
2    NaN       HR       NaN     NaN    3    NaN     pune
3    NaN      SCM       NaN     NaN    4    NaN   mumbai

In [55]:
pd.concat([emp, dept],axis = 1)

   eid     name  salary Address  dno Gender  dno   name lication
0  101    dipaa   30000    pune    1      f  1.0     IT     pune
1  102    soham  310000    pune    2      m  2.0  Admin   mumbai
2  103    pooja   50000  nanded    3      f  3.0     HR     pune
3  104  sangita   60000  mumbai    4      f  4.0    SCM   mumbai
4  105     doly   70000  nanded    5      f  NaN    NaN      NaN
5  106    aarti   66000  nanded    6      f  NaN    NaN      NaN
6  107    Tanvi  230000  Nashik    7      f  NaN    NaN      NaN

## Merging the datafrmaes === (basend on one common column, useing inner join)

In [56]:
pd.merge(emp, dept, on= "dno", how = "inner")

   eid   name_x  salary Address  dno Gender name_y lication
0  101    dipaa   30000    pune    1      f     IT     pune
1  102    soham  310000    pune    2      m  Admin   mumbai
2  103    pooja   50000  nanded    3      f     HR     pune
3  104  sangita   60000  mumbai    4      f    SCM   mumbai

### Left outer join

In [57]:
left_outer = pd.merge(emp,dept, on= "dno", how='left')

In [58]:
left_outer

   eid   name_x  salary Address  dno Gender name_y lication
0  101    dipaa   30000    pune    1      f     IT     pune
1  102    soham  310000    pune    2      m  Admin   mumbai
2  103    pooja   50000  nanded    3      f     HR     pune
3  104  sangita   60000  mumbai    4      f    SCM   mumbai
4  105     doly   70000  nanded    5      f    NaN      NaN
5  106    aarti   66000  nanded    6      f    NaN      NaN
6  107    Tanvi  230000  Nashik    7      f    NaN      NaN

In [59]:
right_outer = pd.merge(emp, dept, on= "dno", how = "right")

In [60]:
right_outer

   eid   name_x  salary Address  dno Gender name_y lication
0  101    dipaa   30000    pune    1      f     IT     pune
1  102    soham  310000    pune    2      m  Admin   mumbai
2  103    pooja   50000  nanded    3      f     HR     pune
3  104  sangita   60000  mumbai    4      f    SCM   mumbai

### Fetching data after merging  Dataframes

In [61]:
left_outer[["name_x","name_y","lication"]]

    name_x name_y lication
0    dipaa     IT     pune
1    soham  Admin   mumbai
2    pooja     HR     pune
3  sangita    SCM   mumbai
4     doly    NaN      NaN
5    aarti    NaN      NaN
6    Tanvi    NaN      NaN

### Agrigate functions

In [62]:
emp

   eid     name  salary Address  dno Gender
0  101    dipaa   30000    pune    1      f
1  102    soham  310000    pune    2      m
2  103    pooja   50000  nanded    3      f
3  104  sangita   60000  mumbai    4      f
4  105     doly   70000  nanded    5      f
5  106    aarti   66000  nanded    6      f
6  107    Tanvi  230000  Nashik    7      f

In [63]:
emp["salary"].max()

np.int64(310000)

In [64]:
emp["salary"].min()

np.int64(30000)

In [65]:
emp["salary"].mean()

np.float64(116571.42857142857)

In [66]:
emp["salary"].sum()

np.int64(816000)

In [67]:
emp["salary"].count()

np.int64(7)

### Aggregate Functions  =====(Mean,mod,count,max,min,sum)

In [68]:
emp["salary"].max()

np.int64(310000)

In [69]:
emp["salary"].mean()

np.float64(116571.42857142857)

In [70]:
emp["salary"].min()

np.int64(30000)

In [71]:
emp["salary"].count()

np.int64(7)

In [72]:
# emp["Address"].mod()

### Groupby

In [73]:
emp

   eid     name  salary Address  dno Gender
0  101    dipaa   30000    pune    1      f
1  102    soham  310000    pune    2      m
2  103    pooja   50000  nanded    3      f
3  104  sangita   60000  mumbai    4      f
4  105     doly   70000  nanded    5      f
5  106    aarti   66000  nanded    6      f
6  107    Tanvi  230000  Nashik    7      f

In [74]:
emp.groupby("Gender")["Gender"].count()

Gender
f    6
m    1
Name: Gender, dtype: int64

In [75]:
emp.groupby("Gender")["salary"].max()

Gender
f    230000
m    310000
Name: salary, dtype: int64

In [76]:
emp.groupby("dno")["salary"].mean()

dno
1     30000.0
2    310000.0
3     50000.0
4     60000.0
5     70000.0
6     66000.0
7    230000.0
Name: salary, dtype: float64

In [77]:
emp["Address"]

0      pune
1      pune
2    nanded
3    mumbai
4    nanded
5    nanded
6    Nashik
Name: Address, dtype: object

In [78]:
## find out  no of people in each city
emp.groupby("Address")["Address"].count()

Address
Nashik    1
mumbai    1
nanded    3
pune      2
Name: Address, dtype: int64

## Value_counts ======(no of enterys for that perticular column, on desending order of count)

In [79]:
emp["dno"].value_counts()

dno
1    1
2    1
3    1
4    1
5    1
6    1
7    1
Name: count, dtype: int64

In [80]:
emp["Address"].value_counts().index

Index(['nanded', 'pune', 'mumbai', 'Nashik'], dtype='object', name='Address')

In [81]:
emp["BG"] = ["A+","AB+","O+",np.nan,np.nan,np.nan,np.nan]

In [82]:
emp

   eid     name  salary Address  dno Gender   BG
0  101    dipaa   30000    pune    1      f   A+
1  102    soham  310000    pune    2      m  AB+
2  103    pooja   50000  nanded    3      f   O+
3  104  sangita   60000  mumbai    4      f  NaN
4  105     doly   70000  nanded    5      f  NaN
5  106    aarti   66000  nanded    6      f  NaN
6  107    Tanvi  230000  Nashik    7      f  NaN

#### how many null values are prasent in each column

In [83]:
emp.isna().sum()

eid        0
name       0
salary     0
Address    0
dno        0
Gender     0
BG         4
dtype: int64

### making null value syntax

In [84]:
emp.loc[emp["name"]== "Tanvi","salary"]= np.nan

In [85]:
emp

   eid     name    salary Address  dno Gender   BG
0  101    dipaa   30000.0    pune    1      f   A+
1  102    soham  310000.0    pune    2      m  AB+
2  103    pooja   50000.0  nanded    3      f   O+
3  104  sangita   60000.0  mumbai    4      f  NaN
4  105     doly   70000.0  nanded    5      f  NaN
5  106    aarti   66000.0  nanded    6      f  NaN
6  107    Tanvi       NaN  Nashik    7      f  NaN

In [86]:
# emp.drop("Address",axis = 1)

## Handling Missing values

   ### 1> Deliting rows
   ### 2> Deliting column
   ### 3> Filling records

### Filling records  === (Fillna())

##### (Filling the tanvis record of salry with finding department no and avg salary of that dept basis on that we going to feel)

In [87]:
avg_sal = emp[emp["dno"]==2]["salary"].mean()

In [88]:
emp["salary"] = emp["salary"].fillna(avg_sal)

In [89]:
emp

   eid     name    salary Address  dno Gender   BG
0  101    dipaa   30000.0    pune    1      f   A+
1  102    soham  310000.0    pune    2      m  AB+
2  103    pooja   50000.0  nanded    3      f   O+
3  104  sangita   60000.0  mumbai    4      f  NaN
4  105     doly   70000.0  nanded    5      f  NaN
5  106    aarti   66000.0  nanded    6      f  NaN
6  107    Tanvi  310000.0  Nashik    7      f  NaN

## Reding Data Through File(READ_CSV)

In [90]:
data = pd.read_csv("DATAFRAMES/Iris.csv")
data

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [91]:
data.shape

(150, 5)

In [92]:
data.columns

Index(['Sepal_Length', 'Sepal_Width', 'Petal_Length', 'Petal_Width',
       'Species'],
      dtype='object')

In [93]:
data.head()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [94]:
data.head(10)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa
5           5.4          3.9           1.7          0.4  Setosa
6           4.6          3.4           1.4          0.3  Setosa
7           5.0          3.4           1.5          0.2  Setosa
8           4.4          2.9           1.4          0.2  Setosa
9           4.9          3.1           1.5          0.1  Setosa

In [95]:
data.tail()

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [96]:
data.tail(10)

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
140           6.7          3.1           5.6          2.4  Virginica
141           6.9          3.1           5.1          2.3  Virginica
142           5.8          2.7           5.1          1.9  Virginica
143           6.8          3.2           5.9          2.3  Virginica
144           6.7          3.3           5.7          2.5  Virginica
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [97]:
data.isna().sum()

Sepal_Length    0
Sepal_Width     0
Petal_Length    0
Petal_Width     0
Species         0
dtype: int64

In [98]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal_Length  150 non-null    float64
 1   Sepal_Width   150 non-null    float64
 2   Petal_Length  150 non-null    float64
 3   Petal_Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [99]:
## how many types of flowers are prasent in data

data["Species"].unique()

array(['Setosa', 'Versicolor', 'Virginica'], dtype=object)

In [100]:
## count of types of flowers are in data

data["Species"].nunique()

3

In [101]:
## each falwers record 

data["Species"].value_counts()

Species
Setosa        50
Versicolor    50
Virginica     50
Name: count, dtype: int64

In [102]:
data1 = pd.read_csv("DATAFRAMES/cars93.csv")

In [103]:
data1.head(10)

,Manufacturer,Model,Type,Price,MPG.city,AirBags,Horsepower,Passengers,Rear.seat.room,Luggage.room
0,Acura,Integra,Small,15.9,25,Driver only,140,5,26.5,11.0
1,Acura,Legend,Midsize,33.9,18,Driver & Passenger,200,5,30.0,15.0
2,Audi,90,Compact,29.1,20,Driver only,172,5,28.0,14.0
3,Audi,100,Midsize,37.7,19,Driver & Passenger,172,6,31.0,17.0
4,BMW,535i,Midsize,30.0,22,Driver only,208,4,27.0,13.0
5,Buick,Century,Midsize,15.7,22,Driver only,110,6,28.0,16.0
6,Buick,LeSabre,Large,20.8,19,Driver only,170,6,30.5,17.0
7,Buick,Roadmaster,Large,23.7,16,Driver only,180,6,30.5,21.0
8,Buick,Riviera,Midsize,26.3,19,Driver only,170,5,26.5,14.0
9,Cadillac,DeVille,Large,34.7,16,Driver only,200,6,35.0,18.0

In [104]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Manufacturer    93 non-null     object
 1   Model           93 non-null     object
 2   Type            93 non-null     object
 3   Price           93 non-null     float64
 4   MPG.city        93 non-null     int64
 5   AirBags         79 non-null     object
 6   Horsepower      93 non-null     int64
 7   Passengers      93 non-null     int64
 8   Rear.seat.room  91 non-null     float64
 9   Luggage.room    82 non-null     float64
dtypes: float64(3), int64(3), object(4)
memory usage: 7.4+ KB

In [105]:
data1.columns

Index(['Manufacturer', 'Model', 'Type', 'Price', 'MPG.city', 'AirBags',
       'Horsepower', 'Passengers', 'Rear.seat.room', 'Luggage.room'],
      dtype='object')

In [106]:
data1.isna().sum()

Manufacturer       0
Model              0
Type               0
Price              0
MPG.city           0
AirBags           14
Horsepower         0
Passengers         0
Rear.seat.room     2
Luggage.room      11
dtype: int64

In [107]:
data1.shape

(93, 10)

#  (Deliting rows)

### print the those rows where raire_seat_room values are missing , and delting that rows

In [108]:
rows_to_delet = data1[data1["Rear.seat.room"].isna()].index

In [109]:
data2 = data1.drop(rows_to_delet)

In [110]:
data2

,Manufacturer,Model,Type,Price,MPG.city,AirBags,Horsepower,Passengers,Rear.seat.room,Luggage.room
0,Acura,Integra,Small,15.9,25,Driver only,140,5,26.5,11.0
1,Acura,Legend,Midsize,33.9,18,Driver & Passenger,200,5,30.0,15.0
2,Audi,90,Compact,29.1,20,Driver only,172,5,28.0,14.0
3,Audi,100,Midsize,37.7,19,Driver & Passenger,172,6,31.0,17.0
4,BMW,535i,Midsize,30.0,22,Driver only,208,4,27.0,13.0
...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,19.7,17,Driver & Passenger,109,7,34.0,NaN
89,Volkswagen,Passat,Compact,20.0,21,Driver & Passenger,134,5,31.5,14.0
90,Volkswagen,Corrado,Sporty,23.3,18,Driver & Passenger,178,4,26.0,15.0
91,Volvo,240,Compact,22.7,21,Driver only,114,5,29.5,14.0
92,Volvo,850,Midsize,26.7,20,Driver & Passenger,168,5,30.0,15.0

In [111]:
data2.isna().sum()

Manufacturer       0
Model              0
Type               0
Price              0
MPG.city           0
AirBags           14
Horsepower         0
Passengers         0
Rear.seat.room     0
Luggage.room       9
dtype: int64